export default {
  methods: {
    filtersHbState(val, type) {
      //  0微信红包 1 红包零钱  2企业付款红包 3品牌红包
      const stateMap = {
        0: {
          '-1': '发放失败，请联系品牌商补发',
          0: '发放中，请耐心等待',
          1: '发放成功(已到账)，请前往微信钱包查看',
          2: '发放成功(已到账)，请前往微信钱包查看',
          4: '发放成功(待到账)，请耐心等待',
          5: '发放成功(待到账)，请耐心等待',
          6: '发放成功(待到账)，请耐心等待'
        },
        3: {
          '-1': '发放失败，请联系品牌商补发',
          0: '发放中，请耐心等待',
          1: '发放成功(已到账)，请前往微信钱包查看',
          2: '发放成功(已到账)，请前往微信钱包查看',
          4: '发放成功(待到账)，请耐心等待',
          5: '发放成功(待到账)，请耐心等待',
          6: '发放成功(待到账)，请耐心等待'
        },
        2: {
          '-1': '发放失败，请联系品牌商补发',
          0: '发放中，请耐心等待',
          1: '发放成功(已到账)，请前往微信钱包查看',
          2: '发放成功(已到账)，请前往微信钱包查看',
          4: '发放成功(待到账)，请耐心等待',
          5: '发放成功(待到账)，请耐心等待',
          6: '发放成功(待到账)，请耐心等待'
        },
        1: {
          '-1': '发放失败，请联系品牌商补发',
          0: '发放中，请耐心等待',
          1: '红包发放成功，请前往“红包零钱”提现',
          2: '红包发放成功，请前往“红包零钱”提现',
          4: '发放成功(待到账)，请耐心等待',
          5: '发放成功(待到账)，请耐心等待',
          6: '发放成功(待到账)，请耐心等待'
        }
      }

      return stateMap[type]?.[val] || ''
    },
    filtersState(val) {
      switch (val) {
        case -1:
          return '未通过'
        case 0:
          return '待审核'
        case 1:
          return '通过'
        default:
          break
      }
    },
    filterActivityState(val) {
      switch (val) {
        case 1:
          return '未开始'
        case 2:
          return '已结束'
        case 3:
          return '已暂停'
        case 4:
          return '已删除'
        default:
          break
      }
    }
  }
}
